{"text": "Early man deified some of the inanimate matter and some among the animals and plants.", "fibs": ["animals", "plants", "early man", "inanimate matter"]}
{"text": "A common feature of all such forms of inanimate and animate objects was the sense of awe or fear that they evoked.", "fibs": ["fear", "awe", "sense", "inanimate", "common feature", "such forms", "animate objects"]}
{"text": "The description of living organisms including human beings began much later in human history.", "fibs": ["description", "organisms", "human history", "human beings"]}
{"text": "The biggest spin off of such studies was the recognition of the sharing of similarities among living organisms both horizontally and vertically.", "fibs": ["organisms", "sharing", "similarities", "recognition", "biggest spin", "such studies"]}
{"text": "That all present day living organisms are related to each other and also to all organisms that ever lived on this earth, was a revelation which humbled man and led to cultural movements for conservation of biodiversity.", "fibs": ["earth", "conservation", "biodiversity", "revelation", "other", "organisms", "man"]}
{"text": "Growth, reproduction, ability to sense environment and mount a suitable response come to our mind immediately as unique features of living organisms.", "fibs": ["organisms", "growth", "reproduction", "ability", "mind", "environment", "unique features"]}
{"text": "Growth, therefore, cannot be taken as a defining property of living organisms.", "fibs": ["growth", "property", "organisms"]}
{"text": "In multicellular organisms, reproduction refers to the production of progeny possessing features more or less similar to those of parents.", "fibs": ["parents", "similar", "reproduction", "production", "progeny", "multicellular organisms"]}
{"text": "Perhaps, the most obvious and technically complicated feature of all living organisms is this ability to sense their surroundings or environment and respond to these environmental stimuli which could be physical, chemical or biological.", "fibs": ["obvious", "physical", "chemical", "biological", "surroundings", "environment", "ability"]}
{"text": "All organisms, from the prokaryotes to the most complex eukaryotes can sense and respond to environmental cues.", "fibs": ["organisms", "prokaryotes", "environmental cues", "complex eukaryotes"]}
{"text": "Human being is the only organism who is aware of himself, i.e., has self-consciousness.", "fibs": ["self", "consciousness", "aware", "human being", "only organism"]}
{"text": "All living organisms – present, past and future, are linked to one another by the sharing of the common genetic material, but to varying degrees.", "fibs": ["degrees", "organisms", "present", "past", "sharing", "future", "one"]}
{"text": "This refers to biodiversity or the number and types of organisms present on earth.", "fibs": ["biodiversity", "earth", "number", "types", "organisms present"]}
{"text": "In order to facilitate the study, number of scientists have established procedures to assign a scientific name to each known organism.", "fibs": ["order", "organism", "study", "number", "scientists", "procedures", "scientific name"]}
{"text": "For plants, scientific names are based on agreed principles and criteria, which are provided in International Code for Botanical Nomenclature to arrive at the same name.", "fibs": ["plants", "criteria", "principles", "botanical nomenclature", "scientific names", "international code", "same name"]}
{"text": "They also ensure that such a name has not been used for any other known organism.", "fibs": ["name", "other known organism"]}
{"text": "In this name Mangifera represents the genus while indica, is a particular species, or a specific epithet.", "fibs": ["genus", "indica", "name mangifera", "specific epithet", "particular species"]}
{"text": "The first word in a biological name represents the genus while the second component denotes the specific epithet.", "fibs": ["genus", "first word", "specific epithet", "biological name", "second component"]}
{"text": "Classification is the process by which anything is grouped into convenient categories based on some easily observable characters.", "fibs": ["classification", "process", "anything", "observable characters", "convenient categories"]}
{"text": "External and internal structure, along with the structure of cell, development process and ecological information of organisms are essential and form the basis of modern taxonomic studies.", "fibs": ["external", "basis", "cell", "organisms", "essential", "structure", "development process"]}
{"text": "Human beings have always been interested in knowing more and more about the various kinds of organisms, particularly with reference to their own use.", "fibs": ["reference", "interested", "organisms", "human beings", "own use", "more", "various kinds"]}
{"text": "Human beings were, since long, not only interested in knowing more about different kinds of organisms and their diversities, but also the relationships among them.", "fibs": ["relationships", "more", "diversities", "human beings", "organisms", "interested", "different kinds"]}
{"text": "The word systematics is derived from the Latin word ‘systema’ which means systematic arrangement of organisms.", "fibs": ["organisms", "systema", "systematic arrangement", "latin word", "word systematics"]}
{"text": "Each category, referred to as a unit of classification, in fact, represents a rank and is commonly termed as taxon .", "fibs": ["taxon", "category", "fact", "unit", "classification", "rank"]}
{"text": "Insects represent a group of organisms sharing common features like three pairs of jointed legs.", "fibs": ["insects", "group", "pairs", "organisms", "jointed legs", "common features"]}
{"text": "Taxonomical studies of all known organisms have led to the development of common categories such as kingdom, phylum or division , class, order, family, genus and species.", "fibs": ["family", "order", "organisms", "development", "taxonomical studies", "kingdom", "phylum"]}
{"text": "All organisms, including those in the plant and animal kingdoms have species as the lowest category.", "fibs": ["organisms", "species", "plant", "lowest category", "animal kingdoms"]}
{"text": "The basic requirement is the knowledge of characters of an individual or group of organisms.", "fibs": ["group", "organisms", "knowledge", "characters", "individual", "basic requirement"]}
{"text": "This helps in identifying similarities and dissimilarities among the individuals of the same kind of organisms as well as of other kinds of organisms.", "fibs": ["similarities", "dissimilarities", "individuals", "organisms", "other kinds", "same kind"]}
{"text": "Taxonomic studies consider a group of individual organisms with fundamental similarities as a species.", "fibs": ["species", "group", "taxonomic studies", "fundamental similarities", "individual organisms"]}
{"text": "All the three names, indica, tuberosum and leo, represent the specific epithets, while the first words Mangifera, Solanum and Panthera are genera and represents another higher level of taxon or category.", "fibs": ["taxon", "indica", "tuberosum", "leo", "panthera", "solanum", "genera"]}
{"text": "Each genus may have one or more than one specific epithets representing different organisms, but having morphological similarities.", "fibs": ["genus", "more", "morphological similarities", "different organisms", "specific epithets"]}
{"text": "For example, Panthera has another specific epithet called tigris and Solanum includes species like nigrum and melongena.", "fibs": ["melongena", "example", "panthera", "species", "nigrum", "solanum", "tigris"]}
{"text": "Human beings belong to the species sapiens which is grouped in the genus Homo.", "fibs": ["species", "human beings", "genus homo"]}
{"text": "Genus comprises a group of related species which has more characters in common in comparison to species of other genera.", "fibs": ["genus", "group", "comparison", "common", "other genera", "species", "more characters"]}
{"text": "For example, potato and brinjal are two different species but both belong to the genus Solanum.", "fibs": ["example", "potato", "brinjal", "genus solanum", "different species"]}
{"text": "Lion with several common features, are all species of the genus Panthera.", "fibs": ["lion", "species", "genus panthera", "several common features"]}
{"text": "The next category, Family, has a group of related genera with still less number of similarities as compared to genus and species.", "fibs": ["genus", "species", "family", "similarities", "group", "next category", "less number"]}
{"text": "Among plants for example, three different genera Solanum, Petunia and Datura are placed in the family Solanaceae.", "fibs": ["plants", "example", "datura", "petunia", "family solanaceae", "different genera solanum"]}
{"text": "Among animals for example, genus Panthera, comprising lion, tiger, leopard is put along with genus, Felis in the family Felidae.", "fibs": ["animals", "felis", "example", "leopard", "tiger", "family felidae", "genus"]}
{"text": "Generally, order and other higher taxonomic categories are identified based on the aggregates of characters.", "fibs": ["characters", "order", "aggregates", "other higher taxonomic categories"]}
{"text": "Order being a higher category, is the assemblage of families which exhibit a few similar characters.", "fibs": ["order", "families", "assemblage", "higher category", "few similar characters"]}
{"text": "The similar characters are less in number as compared to different genera included in a family.", "fibs": ["family", "less", "number", "similar characters", "different genera"]}
{"text": "For example, order Primata comprising monkey, gorilla and gibbon is placed in class Mammalia along with order Carnivora that includes animals like tiger, cat and dog.", "fibs": ["dog", "example", "cat", "tiger", "gorilla", "animals", "gibbon"]}
{"text": "Classes comprising animals like fishes, amphibians, reptiles, birds along with mammals constitute the next higher category called Phylum.", "fibs": ["classes", "phylum", "animals", "fishes", "amphibians", "birds", "reptiles"]}
{"text": "In case of plants, classes with a few similar characters are assigned to a higher category called Division.", "fibs": ["division", "case", "plants", "classes", "higher category", "few similar characters"]}
{"text": "All animals belonging to various phyla are assigned to the highest category called Kingdom Animalia in the classification system of animals.", "fibs": ["animals", "various phyla", "classification system", "kingdom animalia", "highest category"]}
{"text": "TABLE 1.1 Organisms with their Taxonomic Categories 1.4 Taxonomical Aids Taxonomic studies of various species of plants, animals and other organisms are useful in agriculture, forestry, industry and in general in knowing our bio-resources and their diversity.", "fibs": ["general", "useful", "industry", "plants", "animals", "organisms", "various species"]}
{"text": "The collection of actual specimens of plant and animal species is essential and is the prime source of taxonomic studies.", "fibs": ["collection", "plant", "essential", "taxonomic studies", "actual specimens", "prime source", "animal species"]}
{"text": "It is used for classification of an organism, and the information gathered is also stored along with the specimens.", "fibs": ["specimens", "classification", "organism", "information"]}
{"text": "The herbarium sheets also carry a label providing information about date and place of collection, English, local and botanical names, family, collector’s name, etc.", "fibs": ["family", "information", "place", "date", "english", "collection", "local"]}
{"text": "Plant species in these gardens are grown for identification purposes and each plant is labelled indicating its botanical/scientific name and its family.", "fibs": ["family", "gardens", "botanical", "scientific name", "plant", "identification purposes", "plant species"]}
{"text": "Museums have collections of preserved plant and animal specimens for study and reference.", "fibs": ["museums", "reference", "collections", "study", "plant", "animal specimens"]}
{"text": "Separate taxonomic keys are required for each taxonomic category such as family, genus and species for identification purposes.", "fibs": ["genus", "species", "family", "identification purposes", "separate taxonomic keys", "taxonomic category such"]}
{"text": "Manuals are useful in providing information for identification of names of species found in an area.", "fibs": ["area", "manuals", "useful", "information", "species", "identification", "names"]}
{"text": "Millions of plants and animals have been identified and described but a large number still remains unknown.", "fibs": ["unknown", "millions", "plants", "animals", "large number"]}
{"text": "The very range of organisms in terms of size, colour, habitat, physiological and morphological features make us seek the defining characteristics of living organisms.", "fibs": ["characteristics", "habitat", "terms", "physiological", "organisms", "size", "colour"]}
{"text": "In order to facilitate the study of kinds and diversity of organisms, biologists have evolved certain rules and principles for identification, nomenclature and classification of organisms.", "fibs": ["study", "nomenclature", "classification", "kinds", "identification", "diversity", "principles"]}
{"text": "The taxonomic studies of various species of plants and animals are useful in agriculture, forestry, industry and in general for knowing our bio-resources and their diversity.", "fibs": ["bio", "forestry", "industry", "general", "plants", "agriculture", "animals"]}
{"text": "The basics of taxonomy like identification, naming and classification of organisms are universally evolved under international codes.", "fibs": ["basics", "taxonomy", "identification", "naming", "organisms", "classification", "international codes"]}
{"text": "Based on the resemblances and distinct differences, each organism is identified and assigned a correct scientific/biological name comprising two words as per the binomial system of nomenclature.", "fibs": ["nomenclature", "resemblances", "organism", "words", "distinct differences", "binomial system", "correct scientific"]}
{"text": "There are many categories/ranks and are generally referred to as taxonomic categories or taxa.", "fibs": ["taxa", "ranks", "many categories", "taxonomic categories"]}
{"text": "Taxonomists have developed a variety of taxonomic aids to facilitate identification, naming and classification of organisms.", "fibs": ["taxonomists", "organisms", "classification", "variety", "identification", "naming", "taxonomic aids"]}
{"text": "Live specimens, on the other hand, of plants and animals, are found in botanical gardens or in zoological parks.", "fibs": ["specimens", "animals", "plants", "zoological parks", "other hand", "botanical gardens"]}
{"text": "Discuss with your teacher the meaning of species in case of higher plants and animals on one hand, and bacteria on the other hand.", "fibs": ["teacher", "meaning", "species", "bacteria", "case", "animals", "hand"]}
{"text": "Illustrate the taxonomical hierarchy with suitable examples of a plant and an animal.", "fibs": ["animal", "plant", "taxonomical hierarchy", "suitable examples"]}
